Revit 2027 API
Frame.BasisZ Property
 The third basis vector of the frame.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ BasisZ { get; set; }
Public Property BasisZ As XYZ
	Get
	Set
public:
property XYZ^ BasisZ {
	XYZ^ get ();
	void set (XYZ^ value);
}
member BasisZ : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
Frame Class
Autodesk.Revit.DB Namespace